console.log(`
    1. Слайдер в <destinations>:[+50] \n
        - на десктоп варинате слайдер работает верно, согласно требованиям к функционалу. Он не бесконечный, но по условию в этом и нет необходимости.(+20)\n
        - три точки внизу отображают номер слайда, они также выступают и дополнительными кнопками для выбора активного слайда.\n
        На мобильном варианте переключение происходит по стрелкам, там карусель бесконечная.(+20)\n
        - слайдер везде меняется плавно - transition 1s.(+10)\n
    2. Попап:[+50]\n
        - попап соотвествует верстке, закрытие происходит при клике вне попапа и при успешном Alert.(+25)\n
        - инпуты email и password переносят свои занчения в браузерный Alert после нажатия на Sign In.(+25)\n
    3. Нажатие на Register меняет разметку попапа. Попап возвращается в изначальную форму после нажатия на Log In.[+25]\n\n
    
    Итоговая оценка при самостоятельной проверке максимальная.\n
    К сожалению, мне не удалось реализовать весь функционал чисто и аккуратно, и мой код может показаться костыльным.\n
    Но не думаю, что это должно стать поводом занизить оценку.
`);